plantalog/cadi-gcl/stm32f100/grolly/current/main.c
// two following defines moved to eeprom.h
//#define SETTINGS_PACKET_SIZE	200	// look NumbOfVar define in eeprom.h
//#define SETTINGS_START_ADDR		0x05C0	// HARDCODED in eeprom.c look for this address

#define WATER_TANK_TOP			0x0622
#define WATER_TANK_BOTTOM		0x0632
#define WFM_CAL_OFFSET			0x0642


#define DAY						1
#define NIGHT					0

#define BSRRL					BSRR
#define BSRRH					BRR


#define LOG_SHIFT	1

// analog inputs
#define JDR_EC		ADC1->JDR3		// continuous ADC channel for EC
#define JDR_PH		ADC1->JDR2		// continuous ADC channel for pH
#define JDR_PSI		ADC1->JDR3		// pressure sensor
#define JDR_BUFFER_SIZE 10


#define PSI_SENSOR_0PSI			0x0645
#define PSI_SENSOR_32PSI		0x0646
#define PSI_SENSOR_TOP			0x0647
#define PSI_SENSOR_BTM			0x0648
#define PSI_PUMP_LOAD_ID		0x0649
uint8_t psi_pump_load_id=PSI_PUMP_ID;
uint8_t psi_underOver=0;
uint16_t psi_pump_top_level=0;
uint16_t psi_pump_btm_level=0;
uint16_t psi_cur_adc_value=0;

#define AVG_ADC_EC		3			// adcAverage[AVG_ADC_EC]
#define AVG_ADC_PH		2			// adcAverage[2]
#define AVG_ADC_PSI		2			// adcAverage[2]


uint16_t tank_windows_top[1];
uint16_t tank_windows_bottom[1];

char log_str[64];


uint8_t circulationPumpId;
ErrorStatus  HSEStartUpStatus;
FLASH_Status FlashStatus;
uint16_t ph_seven=0;
uint32_t ph0=0;
uint16_t ph4=0;
uint16_t ec1413 = 0, ec0 = 0;
int cdel=0;

uint16_t adcAverage[4];
uint16_t jdrBuff1[JDR_BUFFER_SIZE];
uint16_t jdrBuff2[JDR_BUFFER_SIZE];
uint16_t jdrBuff3[JDR_BUFFER_SIZE];
uint16_t jdrBuff4[JDR_BUFFER_SIZE];
uint8_t curphstr[5];
uint8_t curecstr[5];

//uint16_t ecAdcValue;
uint8_t currentEc=0;
uint8_t currentPh=0;
uint8_t phUnderOver = 0;	// 0 - pH value is within window, 1 - under window, 2 - over window
uint8_t ecUnderOver = 0;	// 0 - pH value is within window, 1 - under window, 2 - over window
uint16_t phWindowTop, phWindowBottom;
uint16_t ecWindowTop, ecWindowBottom;
uint32_t lastWriteTime=0;
uint8_t wpStateFlags;
uint8_t dosingPumpStateFlags;	// this variable seems to be overwritten by some part of this firmware, therefore dosingPumpStateFlags2 used instead
uint8_t dosingPumpStateFlags2;
uint8_t waterSensorStateFlags;
// uint8_t wsl_buff[3];
uint16_t wfCalArray[WFM_AMOUNT];


#define STATE_NOTHING					0
#define STATE_CONFIGURATION_PAYLOAD		1
#define STATE_CONFIGURATION_CRC			2
#define STATE_COMMAND_TYPE				3
#define STATE_COMMAND_PAYLOAD			4
#define STATE_COMMAND_CRC				5


#define RXM_NONE						0
#define RXM_CMD							4
#define RXM_SET							3
uint8_t cmdbuf[16];		// command packet buffer
uint8_t cmdbufp=0;		// pointer
uint8_t prefixDetectionIdx=0;
uint8_t pb_pntr=0;			// packet buffer pointer
uint8_t packet_length=0;
uint8_t rxm_state=0;
uint8_t packet_ready=0;		// packet readiness flag. reset after command execution
uint8_t rx_packet_crc = 0;	// cmdbuf and ZXn packet header CRC

void hygroStatSettings(void);
uint8_t readPercentVal(uint8_t value);
uint32_t measureDelay(void);
void phMonSettings(void);
void setTimer(uint8_t timerId);
//void copy_arr(uint8_t *source, uint8_t *destination, uint8_t amount, uint8_t pos);
void copy_arr(uint8_t *source, uint8_t *destination, uint8_t amount, uint8_t pos);
void Lcd_write_arr(uc8 *STRING, uint8_t chars);
void Lcd_write_digit(uint8_t numb);
void Delay_us(uint32_t delay);
void buttonCalibration(void);
void Init_pin_out(void);
void Init_pin_in(void);
void Init_lcd(void);
void Lcd_write_data(uint8_t byte);
void Lcd_write_cmd(uint8_t byte);
void Lcd_clear(void);
void Return_home(void);
void Lcd_goto(uc8 x, uc8 y);
void Lcd_write_str(char *STRING);
char* adc2str(uint_fast16_t d, char* out);
void int32str(uint32_t d, char *out);
void AdcInit(void);
uint32_t RTC_GetCounter(void);
void RTC_SetCounter(uint32_t value);
unsigned char RtcInit(void);
uint8_t readButtons(void);
void focusMenuItem(int itemId);
int menuSelector(void);
uint32_t timeAdjust(uint32_t cnt, uint8_t includeDays);
void programRunner(uint8_t programId);
RTC_DateTime unix2DateTime(uint32_t unixtime);
uint32_t DateTime2unix(RTC_DateTime datetime);
void EE_WriteWord(uint16_t Address, uint32_t Data);
uint32_t EE_ReadWord(uint16_t Address);
//void Lcd_print(char *STRING);
void setCTimer(uint8_t timerId);
uint32_t CTimerAdjust(uint32_t time);
void plugStateSet(uint8_t plug, uint8_t state);
void getPh();
void getEc(void);
FRESULT string2log(char* str, int bytes);
FRESULT sdLog2(void);
uint8_t adjust8bit(uint8_t val);
void loggerSettings(void);
int yesNoSelector(char str, int curval);
void loadSettings(void);
void set4lowBits(uint8_t dta);
void set4highBits(uint8_t dta);
void flush_lcd_buffer(void);
void phStabSettings(void);
void Lcd_write_16int(uint16_t);
void saveButtonRanges(void);
void readButtonRanges(void);
void set16bit(uint16_t value);
void convPh2str(uint8_t ph, char* phstr);
uint8_t readPhVal(uint8_t value);
void dht_conv_data(void);
void dht_init(void);
void dht_init_out(void);
void TIM3_IRQHandler(void);
void TIM1_BRK_TIM15_IRQHandler(void);
void dht_arr_displayer(void);
void setPwmDc(uint8_t duty_cycle);
void setDutyCycle(void);
void displayAdcValues(void);
// uint16_t get_average_adc(uint8_t amount);
void EXTI0_IRQHandler(void);
void EXTI1_IRQHandler(void);

void water_program_setup(uint8_t progId);
void fertilization_setup(void);
void watering_setup(void);
void fertilizer_mixing_program_setup(uint8_t progId);
void run_watering_program(uint8_t progId);
void run_fertilizer_mixer(uint8_t progId);
// void calibratEc(void);
void startWp(void);
uint16_t adjust16bit_fast(uint16_t val, uint8_t speed);
char * utoa_fast_div(uint32_t value, char *buffer);

// count crc starting from input and taking buffer from start_byte for length bytes
uint8_t crc_block(uint8_t input, uint8_t *start_byte, uint8_t length);

static void uart_task(void *pvParameters);
static void prvSetupHardware( void );
static void displayClock( void *pvParameters );
static void timerStateTrigger(void *pvParameters);
static void plugStateTrigger(void *pvParameters);
static void sdLog(void *pvParameters);
static void phMonitor(void  *pvParameters);
static void vTaskLCDdraw(void *pvParameters);
static void watering_program_trigger(void *pvParameters);
// static void valveManager(void);
// static void valve_status_updater(void);
void bluetooth_init(void);
void display_usart_rx(void);
void display_usart_tx(void);


void open_valve(uint8_t valveId);
void close_valve(uint8_t valveId);
void run_valve_motor(uint8_t valveId);
void stop_valve_motor(uint8_t valveId);
void valve_test(void);
void valve_feedback_init(void);
void dosing_motor_control_init(void);
void valve_motor_control_init(void);
void valve_init(void);		// startup valve config
void EXTI15_10_IRQHandler(void);
void water_level_input_init(void);
void fertilizer_mixing_program_setup(uint8_t progId);
uint16_t adjust16bit(uint16_t val);
void enable_dosing_pump(uint8_t pumpId, uint8_t state);
void valveMotorStateSet(uint8_t valveId, uint8_t state);
void USART1_IRQHandler(void);
void StartDMAChannel4(unsigned int LengthBufer);
unsigned char GetStateDMAChannel4(void);
void TIM1_TRG_COM_TIM17_IRQHandler(void);
void TIM4_IRQHandler(void);
void tankLevelStabSetup(void);
void tankLevelStab(void);
void Lcd_write_16b(uint16_t tmp);
void Lcd_write_8b(uint8_t tmp);
void run_uart_cmd(void);
void get_water(uint8_t valve, uint8_t counter_id, uint16_t amount);
void get_water_cl(uint8_t valve, uint8_t counter_id, uint16_t amount);
void send_packet();
void setTimerSelector(void);
uint8_t idSelector(uint8_t min, uint8_t max, uint8_t curid);
void printOk(void);
void get_fertilizer(uint8_t fertId, uint8_t secs);
void get_settings_block(uint8_t block_number);
void rx_flush(void);
void adcAverager(void);
void get_status_block(uint8_t blockId);
void run_circulation_pump(uint16_t time);
void send_ee_addr(uint16_t addr, uint8_t type);
void rx_ee(uint16_t addr, uint8_t type);
void autoSafe(void);
void run_doser_for(uint8_t pump_id, uint8_t amount);

// auto_flags
/*
 * 0 - PSI pump stab		(1)
 * 1 - tank level stab		(2)
 * 2 - autoSafe				(4)
 *
 */

uint32_t fup_time = 0;	// first time underpressure met
#define PSI_UNDERPRESSURE	600			// minimum pressure meaning there is water in pump, when it is running
#define PSI_UP_TIMEOUT	60				// seconds to stop PSI pump if underpressure met
void autoSafe(void){
	if (((auto_flags&4)>>2)==1){
		// disale PSI pump in case of over pressure. PSI_OVERPRESSURE sets max
		if (adcAverage[AVG_ADC_PSI]>PSI_OVERPRESSURE) {
			plugStateSet(PSI_PUMP_ID,0);
		}

