plantalog/cadi-gcl/stm32f100/grolly/current/main.c
			}
		}
		/* if (rxm_state==RXM_SET) {
				if (pb_pntr==0) {	// if packet buffer pointer is 0, it points to payload size (payload, including this size byte)
					packet_length=RxByte;	// get packet length
				}
				cmdbuf[pb_pntr++]=RxByte;	// receive byte into cmd buffer and increase command packet buffer pointer
				if (pb_pntr==packet_length) {	// if packet buffer pointer reached packet length (rely on RXM_NONE set later)
					// crc count
					rx_packet_crc = crc_block(48, &cmdbuf[0],packet_length);	// 48 is XOR of "ZX2"
					// crc check
					if (rx_packet_crc==0) {
						packet_ready=1;	// packet received correctly and is ready to process
					}
					else {
						rx_flush();	// discard broken packet
					}
					rxm_state=RXM_NONE; // RX machine state set to NONE, completes RX cycle
					pb_pntr=0;			// packet buffer pointer to 0

				}

		}  */



		if (RxByte==90) {
			// ready
			prefixDetectionIdx = 1;
		}
		else if (RxByte==88 && prefixDetectionIdx==1) {
			// steady
			prefixDetectionIdx = 2;
		}
		else if (prefixDetectionIdx==2) {
			if (RxByte==48) {
				// escaping zero
			}
			else if (RxByte==49){
				// settings
				rxm_state=RXM_SET;
			}
			else if (RxByte==50) {
				// command
				rxm_state=RXM_CMD;
				pb_pntr=0;	// packet buffer pointer to zero to start reading new payload
			}
			prefixDetectionIdx = 0;
		}
	}
}

void save_settings(void){	// wrapper for rx_ee, simplifies settings packet receiving
	if (cmdbuf[0]==5) {		// 16 bit (5: size(1b), addr(2b), data(2b))
		rx_ee((cmdbuf[2]&(cmdbuf[3]<<8)), 1);
	}
	if (cmdbuf[0]==7) {		// 32 bit (7: size(1b), addr(2b), data(4b))
		rx_ee((cmdbuf[2]&(cmdbuf[3]<<8)), 2);
	}
}

/* static void uart_task(void *pvParameters){
	while (1) {
		if (packet_ready==1) {
			if (rxm_state == RXM_CMD) {
				run_uart_cmd();	// when
			}
			if (rxm_state == RXM_SET) {
				save_settings();
			}
			packet_ready=0;
		}
		vTaskDelay(10);
		if (txbuff_ne==1) {	// if TxBuff is not empty (flag set by, for example, get_settings_block())
			send_packet();	// send packet from TxBuff
		}
		vTaskDelay(10);
	}
} */

static void uart_task(void *pvParameters){
	while (1) {
		if (packet_ready==1) {

			run_uart_cmd();	// when
			packet_ready=0;
		}
		vTaskDelay(10);
		if (txbuff_ne==1) {	// if TxBuff is not empty (flag set by, for example, get_settings_block())
			send_packet();	// send packet from TxBuff
		}
		vTaskDelay(10);
	}
}


void send_packet(){
	NbrOfDataToTransfer = TxBuffer[3];	// packet size
	TxCounter=0;						// reset tx buffer pointer
	while (TxCounter<NbrOfDataToTransfer){
		vTaskDelay(5);
	}
	txbuff_ne=0;	// packet sent, reset tx not empty flag
}

void rx_flush(void){
	uint8_t i=0;
	for (i=0; i<16; i++){
		cmdbuf[i] = 0;
	}
}


void run_uart_cmd(void){
	switch (cmdbuf[1]) {
		case 0:
			get_water_cl(cmdbuf[2],cmdbuf[3],cmdbuf[4]*256+cmdbuf[5]);
			break;
		case 1:
			plugStateSet(cmdbuf[2], cmdbuf[3]);
			break;
		case 2:
			comm_state=COMM_DIRECT_DRIVE;
			plugStateSet(PSI_PUMP_ID, 0);	// disables PSI pump when entered CDD mode
			break;
		case 3:
			comm_state=COMM_MONITOR_MODE;
			break;
		case 4:
			open_valve(cmdbuf[2]);
			break;
		case 5:
			close_valve(cmdbuf[2]);
			break;
		case 6:
			get_settings_block(cmdbuf[2]);
			break;
		case 7:
			get_status_block(cmdbuf[2]);
			break;
		case 8:
			if (comm_state==COMM_DIRECT_DRIVE) {
				auto_flags=cmdbuf[2];	// set auto-processing flags
			}
			break;
		case 9:
//			enable_dosing_pump(cmdbuf[2], cmdbuf[3]);
			run_doser_for(cmdbuf[2], cmdbuf[3]);
			break;
		case 10:
			valve_failed = cmdbuf[2];
			break;
		case 11:	// stop all processes and force manual control
			auto_flags=0;
			comm_state=COMM_DIRECT_DRIVE;
			auto_flags = 0;
			plugStateSet(0,0);
			plugStateSet(1,0);
			plugStateSet(2,0);
			plugStateSet(3,0);
			close_valve(2);
			close_valve(3);
			close_valve(0);
			close_valve(1);
			break;
		case 12:
			RTC_SetCounter(cmdbuf[2]*16777216+cmdbuf[3]*65536+cmdbuf[4]*256+cmdbuf[5]);
			break;
		case 13:
			NVIC_SystemReset();
			break;
		case 14:
			get_fertilizer(cmdbuf[2], cmdbuf[3]);
			break;
		case 15:	// receive 16 bit value to store into EEPROM
			rx_ee((cmdbuf[2]&(cmdbuf[3]<<8)), 1);
			break;
		case 16:	// receive 32 bit value to store into EEPROM
			rx_ee((cmdbuf[2]&(cmdbuf[3]<<8)), 2);
			break;
		case 17:	// send 16 bit EEPROM value
			send_ee_addr(cmdbuf[2]+cmdbuf[3]*256, 1);
			break;
		case 18:	// send 32 bit EEPROM value
			send_ee_addr(cmdbuf[2]+cmdbuf[3]*256, 2);
			break;
		case 19:
			loadSettings();
			break;
		case 20:
			valve_busy=0;
			break;
		case 21:
//			wp_next_run(cmdbuf[2](cmdbuf[3]+(cmdbuf[4]<<8)+(cmdbuf[5]<<16)+(cmdbuf[6]<<24)));
			break;
	}
	rx_flush();
}


void wp_next_run(uint8_t wp_id, uint32_t time){
	// setting the last run
}

// adds 'amount' seconds of fertilizer using pump with ID	 = pump_id
void run_doser_for(uint8_t pump_id, uint8_t amount){
	uint32_t finish = 0, now = 0;
	now = RTC_GetCounter();
	finish = now+amount;
	enable_dosing_pump(pump_id, 1);
	while (now<finish) {
		now = RTC_GetCounter();
		vTaskDelay(25);
		get_status_block(1);	// send status blocks
		vTaskDelay(25);
	}
	enable_dosing_pump(pump_id, 0);
}

void rx_ee(uint16_t addr, uint8_t type){
	//addr=(cmdbuf[2]+cmdbuf[3]*256);
	uint32_t val32 = 0;
	uint16_t val16 = 0;
	if (type==1) {
		val16=(cmdbuf[4]&(cmdbuf[5]<<8));
		EE_WriteVariable(addr,val16);
	}
	if (type==2) {
		val32=(cmdbuf[4]&(cmdbuf[5]<<8)&(cmdbuf[6]<<16)&(cmdbuf[7]<<24));
		EE_WriteWord(addr,val32);
	}
}


void send_ee_addr(uint16_t addr, uint8_t type){	// sends EEPROM cell contents via BT-USART
	uint16_t val16;
	uint32_t val32;
	// types: 0 - 8 bit, 1 - 16bit, 2 - 32bit
	if (type==1) {
		addr=(cmdbuf[2]&(cmdbuf[3]<<8));
		EE_ReadVariable(addr, &val16);
		TxBuffer[0] = 90;	// "Z"
		TxBuffer[1] = 88;	// "X"
		TxBuffer[2] = 49;	// "1"
		TxBuffer[3] = 9;
		TxBuffer[4] = cmdbuf[2];
		TxBuffer[5] = cmdbuf[3];
		TxBuffer[6] = (uint8_t)(val16&0xFF);
		TxBuffer[7] = (uint8_t)((val16>>8)&0xFF);
	}
	if (type==2) {
		addr=(cmdbuf[2]&(cmdbuf[3]<<8));
		val32 = EE_ReadWord(addr);
		TxBuffer[0] = 90;	// "Z"
		TxBuffer[1] = 88;	// "X"
		TxBuffer[2] = 49;	// "1"
		TxBuffer[3] = 11;	// ZX1+size+4bytepayload+crc
		TxBuffer[4] = cmdbuf[2];
		TxBuffer[5] = cmdbuf[3];
		TxBuffer[6] = (uint8_t)(val32&0xFF);
		TxBuffer[7] = (uint8_t)((val32>>8)&0xFF);
		TxBuffer[8] = (uint8_t)((val32>>16)&0xFF);
		TxBuffer[9] = (uint8_t)((val32>>24)&0xFF);
	}
//	TxBuffer[39] = crc_block(0, &TxBuffer[0],(TxBuffer[3]-1));
	TxBuffer[(TxBuffer[3]-1)] = crc_block(0, &TxBuffer[0],(TxBuffer[3]-1));
	NbrOfDataToTransfer = TxBuffer[3];
	TxCounter=0;
	txbuff_ne = 1;
}

