plantalog/cadi-gcl/stm32f100/grolly/current/main.c
    NVIC_InitStructure.NVIC_IRQChannel = USART1_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

    // Tx on PA9 as alternate function push-pull
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

  /* Rx on PA10 as input floating */
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

  USART_InitTypeDef USART_InitStructure;

  // USART 1 init
  USART_DeInit(USART1);
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);

  USART_InitStructure.USART_BaudRate = 9600;
  USART_InitStructure.USART_WordLength = USART_WordLength_8b;
  USART_InitStructure.USART_StopBits = USART_StopBits_1;
  USART_InitStructure.USART_Parity = USART_Parity_No;
  USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
  USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
  USART_Init(USART1, &USART_InitStructure);

  USART_ClearFlag(USART1, USART_FLAG_CTS | USART_FLAG_LBD  |
                        USART_FLAG_TC  | USART_FLAG_RXNE
                );
  USART1->CR1  |= USART_CR1_RXNEIE;
  USART1->CR1  |= USART_CR1_TCIE;
  USART_Cmd(USART1, ENABLE);
  NVIC_EnableIRQ(USART1_IRQn);
}



unsigned char GetStateDMAChannel4(void)
{
  if(DMA1->ISR & DMA_ISR_TCIF4) return 1;   //transmission finished
  return 0;                                 //transmission in prograss
}
//********************************************************************************
//Function: start exchange in  direction "memory-DMA-USART1"                           //
//Argument: amount of data                                        //
//********************************************************************************
void StartDMAChannel4(unsigned int LengthBufer)
{
  DMA1_Channel4->CCR   = ~DMA_CCR4_EN;      //disable DMA channel
  DMA1_Channel4->CNDTR =  LengthBufer;      //load data amount to transmit
  DMA1->IFCR          |=  DMA_IFCR_CTCIF4;  //reset end of transmit flag
  DMA1_Channel4->CCR  |=  DMA_CCR4_EN;      //enable DMA channel
}




void valve_feedback_init(void){		// init PA6-8 as input for 3V valve feedback

	// v1.4 config assumes PA5-7 pins as feedback, implement init function
	// v2 config assumes PA6-8 pins as feedback

// PA5-7 setup
	GPIO_InitTypeDef GPIO_InitStructure;
//	EXTI_InitTypeDef EXTI_InitStructure;
//	NVIC_InitTypeDef NVIC_InitStructure;
//	GPIO_PinRemapConfig(GPIO_Remap_PD01, ENABLE);
	  // Enable GPIOA clock
//	  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);

	  // Configure PA5-7 pin as input pull-down
	  GPIO_InitStructure.GPIO_Pin =  GPIO_Pin_8 | GPIO_Pin_4 | GPIO_Pin_5 | GPIO_Pin_6;
//	  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
//	  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PD;
	  GPIO_Init(VALVE_SENSOR_PORT, &GPIO_InitStructure);

//	  GPIO_InitStructure.GPIO_Pin =  GPIO_Pin_0 | GPIO_Pin_1;
//	  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
//	  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
//	  GPIO_Init(VALVE_SENSOR_PORT, &GPIO_InitStructure);
}

void water_level_input_init(void){
#ifdef WFM_PINS_PB0_1			// Configuring PINs for Water Flow Meters
		GPIO_InitTypeDef GPIO_InitStructure;
		EXTI_InitTypeDef EXTI_InitStructure;
		NVIC_InitTypeDef NVIC_InitStructure;

		  // Enable GPIO clock
		  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);

		  // Configure PB0-2 pins as input pull-down
		  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1;
		  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
		  GPIO_Init(GPIOB, &GPIO_InitStructure);


// interrupt config for water level sensor inputs

		  GPIO_EXTILineConfig(GPIO_PortSourceGPIOB, GPIO_PinSource0);
		  EXTI_InitStructure.EXTI_Line = EXTI_Line0;
		  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
		  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising_Falling;
		  EXTI_InitStructure.EXTI_LineCmd = ENABLE;
		  EXTI_Init(&EXTI_InitStructure);

		  GPIO_EXTILineConfig(GPIO_PortSourceGPIOB, GPIO_PinSource1);
		  EXTI_InitStructure.EXTI_Line = EXTI_Line1;
		  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
		  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising_Falling;
		  EXTI_InitStructure.EXTI_LineCmd = ENABLE;
		  EXTI_Init(&EXTI_InitStructure);

		  NVIC_InitStructure.NVIC_IRQChannel = EXTI0_IRQn;
		  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0x0F;
		  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x0F;
		  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
		  NVIC_Init(&NVIC_InitStructure);

		  NVIC_InitStructure.NVIC_IRQChannel = EXTI1_IRQn;
		  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0x0F;
		  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x0F;
		  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
		  NVIC_Init(&NVIC_InitStructure);

#endif
}

void dosing_motor_control_init(void){	// init PC6-PC9 as PWM output for dosing pump control
	  GPIO_InitTypeDef GPIO_InitStructure;
	  TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStruct;
	  TIM_OCInitTypeDef TIM_OCInitStruct;


	    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE );

	    RCC_APB1PeriphClockCmd( RCC_APB1Periph_TIM3, ENABLE );

	    GPIO_StructInit(&GPIO_InitStructure); // Reset init structure

	    // Setup Blue & Green LED on STM32-Discovery Board to use PWM.
	    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6 | GPIO_Pin_7 | GPIO_Pin_8 | GPIO_Pin_9;
	    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;            // Alt Function - Push Pull
	    GPIO_Init(GPIOC, &GPIO_InitStructure );
	    GPIO_PinRemapConfig( GPIO_FullRemap_TIM3, ENABLE );        // Map TIM3_CH3 to GPIOC.Pin8, TIM3_CH4 to GPIOC.Pin9

	    // Let PWM frequency equal 100Hz.
	    // Let period equal 1000. Therefore, timer runs from zero to 1000. Gives 0.1Hz resolution.
	    // Solving for prescaler gives 240.
	    TIM_TimeBaseStructInit( &TIM_TimeBaseInitStruct );
	    TIM_TimeBaseInitStruct.TIM_ClockDivision = TIM_CKD_DIV4;
	    TIM_TimeBaseInitStruct.TIM_Period = 1000 - 1;   // 0..999
	    TIM_TimeBaseInitStruct.TIM_Prescaler = 240 - 1; // Div 240
	    TIM_TimeBaseInit( TIM3, &TIM_TimeBaseInitStruct );

	    TIM_OCStructInit( &TIM_OCInitStruct );
	    TIM_OCInitStruct.TIM_OutputState = TIM_OutputState_Enable;
	    TIM_OCInitStruct.TIM_OCMode = TIM_OCMode_PWM1;
	    // Initial duty cycle equals 0%. Value can range from zero to 1000.
	    TIM_OCInitStruct.TIM_Pulse = 0; // 0 .. 1000 (0=Always Off, 1000=Always On)


	    TIM_OC1Init( TIM3, &TIM_OCInitStruct ); // Channel 3 Blue LED
	    TIM_OC2Init( TIM3, &TIM_OCInitStruct ); // Channel 3 Blue LED
	    TIM_OC3Init( TIM3, &TIM_OCInitStruct ); // Channel 3 Blue LED
	    TIM_OC4Init( TIM3, &TIM_OCInitStruct ); // Channel 4 Green LED

	    TIM_Cmd( TIM3, ENABLE );
}


