plantalog/cadi-gcl/stm32f100/grolly/current/main.c
void tankLevelStabSetup(void){
	Lcd_clear();
	uint16_t curlevel=0;
	uint8_t button=0, tmp=0;
	Lcd_clear();
//	Lcd_write_str("Supply valve ID");
//	EE_ReadVariable(WATER_TANK_SUPPLY_VALVE, &tmp);
//	tmp = adjust8bit(tmp);
//	EE_WriteVariable(WATER_TANK_SUPPLY_VALVE, tmp);
//	printOk();
	vTaskDelay(10);
	Lcd_clear();
	Lcd_write_str("Set tank top lvl");
	while (button!=BUTTON_OK) {
		button = readButtons();
		curlevel = sonar_read[0];
		vTaskDelay(5);
		Lcd_goto(1,0);
		Lcd_write_digit(curlevel/100);
		Lcd_write_digit(curlevel);
	}
	vTaskDelay(10);
	EE_WriteVariable(WATER_TANK_TOP, curlevel);
	printOk();
	vTaskDelay(2000);
	Lcd_write_str("Set btm lvl");
	button = 0;
/*	while (button!=BUTTON_OK) {
		button = readButtons();
		curlevel = sonar_read[0];
		vTaskDelay(5);
		Lcd_goto(1,0);
		Lcd_write_digit(curlevel/100);
		Lcd_write_digit(curlevel);
	}
	button=0;
	vTaskDelay(10);
	EE_WriteVariable(WATER_TANK_BOTTOM, curlevel);
	printOk();
	vTaskDelay(2000); */
	Lcd_clear();
	loadSettings();
}

void tankLevelStab(void){
#ifdef TANK_STAB_ENABLE
	vTaskDelay(1);
//	uint16_t tmp=0;
	uint8_t supply_valve=0;
//	EE_ReadVariable(WATER_TANK_SUPPLY_VALVE,&tmp);
	vTaskDelay(1);
//	supply_valve = (uint8_t)(tmp&0x00FF);
	if (((auto_flags&2)>>1)==1) {		// TANK STAB flag 1
			if (sonar_read[0]>(tank_windows_top[0]+2)) {
				open_valve(WI_VALVE);
			}
			vTaskDelay(1);
			if (sonar_read[0]<tank_windows_top[0]) {
				close_valve(WI_VALVE);
			}
	}
#endif
}


void open_valve(uint8_t valveId){
	if (valveId==0) {
		VALVE_CTRL_PORT->BRR |= (1<<8);			// valveId=0 is FWI valve
	}
	else {
		VALVE_CTRL_PORT->BRR |= (1<<valveId+10);	// 10 - shift for PA11 for valve 1
	}
	valveFlags |= (1<<valveId); // set flag
}

void close_valve(uint8_t valveId){
	if (valveId==0) {
		VALVE_CTRL_PORT->BSRR |= (1<<8);			// valveId=0 is FWI valve
	}
	else {
		VALVE_CTRL_PORT->BSRR |= (1<<valveId+10);	// 10 - shift for PA11 as valve 1
	}
	valveFlags &= ~(1<<valveId); // reset flag
}


void EXTI0_IRQHandler(void) {
	EXTI_ClearITPendingBit(EXTI_Line0);
#ifdef WFM_PINS_PB0_1	// water flow meter (WFM) driver actions
	water_counter[0]++;
#endif
}

void EXTI1_IRQHandler(void) {
	EXTI_ClearITPendingBit(EXTI_Line1);
#ifdef WFM_PINS_PB0_1
	water_counter[1]++;
#endif

}

void EXTI2_IRQHandler(void) {
	EXTI_ClearITPendingBit(EXTI_Line2);

}

void EXTI15_10_IRQHandler(void)
{
    // Clear the  EXTI line 10-12 pending bit
	EXTI_ClearITPendingBit(EXTI_Line10);
	EXTI_ClearITPendingBit(EXTI_Line11);
	EXTI_ClearITPendingBit(EXTI_Line12);
}

void EXTI9_5_IRQHandler(void)
{
    // Clear the  EXTI line 10-12 pending bit
	EXTI_ClearITPendingBit(EXTI_Line5);
	EXTI_ClearITPendingBit(EXTI_Line6);
	EXTI_ClearITPendingBit(EXTI_Line7);
}

void valve_test2(void){
	uint8_t button=0, curvalve=0;
	Lcd_clear();

	while (button!=BUTTON_OK) {
		vTaskDelay(20);
		button=readButtons();
#ifdef USE_VALVES
		Lcd_goto(0,0);
		Lcd_write_str("curvalve:");
		Lcd_write_digit(curvalve);



		if (button==BUTTON_FWD){
			//open_valve(curvalve);
			open_valve(curvalve);
		}
		if (button==BUTTON_CNL){
			//close_valve(curvalve);
			close_valve(curvalve);
		}
		if (button==BUTTON_BCK){
			if (curvalve<2) {
				curvalve++;
			}
			else {
				curvalve=0;
			}
		}
		vTaskDelay(1);
		Lcd_goto(1,0);
		Lcd_write_str("VF");
		Lcd_write_digit(valveFlags);

		vTaskDelay(1);

		Lcd_write_str("States:");

		if (VALVE_SENSOR_PORT->IDR&(1<<4)) {
			Lcd_write_str("1");
		}
		else {
			Lcd_write_str("0");
		}
		if (VALVE_SENSOR_PORT->IDR&(1<<5)) {
			Lcd_write_str("1");
		}
		else {
			Lcd_write_str("0");

		if (VALVE_SENSOR_PORT->IDR&(1<<6)) {
			Lcd_write_str("1");
		}
		else {
			Lcd_write_str("0");
		}

		if (VALVE_SENSOR_PORT->IDR&(1<<8)) {
			Lcd_write_str("1");
		}
		else {
			Lcd_write_str("0");
		}
		}

#endif
	}
	Lcd_clear();
}

void valve_test3(void){
	uint8_t button=0, curvalve=2;
	Lcd_clear();

	while (button!=BUTTON_OK) {
		vTaskDelay(20);
		button=readButtons();
#ifdef USE_VALVES
		Lcd_goto(0,0);
		Lcd_write_str("curvalve:");
		Lcd_write_digit(curvalve);
		if (button==BUTTON_FWD){
			//open_valve(curvalve);
			VALVE_CTRL_PORT->BSRR |= (1<<(11+curvalve));
		}
		if (button==BUTTON_CNL){
			//close_valve(curvalve);
			VALVE_CTRL_PORT->BRR |= (1<<(11+curvalve));
		}
		if (button==BUTTON_BCK){
			if (curvalve<4) {
				curvalve++;
			}
			else {
				curvalve=2;
			}
		}
		vTaskDelay(1);
		Lcd_goto(1,0);
		Lcd_write_str("VF");
		Lcd_write_digit(valveFlags);

		vTaskDelay(1);

		Lcd_write_str("States:");

		if (GPIOA->ODR&(1<<13)) {
			Lcd_write_str("1");
		}
		else {
			Lcd_write_str("0");
		}
		if (GPIOA->ODR&(1<<14)) {
			Lcd_write_str("1");
		}
		else {
			Lcd_write_str("0");
		}

#endif
	}
	Lcd_clear();
}


void valve_test(void){
	uint8_t button=0;
	uint16_t tmp=0;
	Lcd_clear();
	while (button!=BUTTON_OK) {
		vTaskDelay(20);
		button=readButtons();
#ifdef USE_VALVES
		Lcd_goto(0,0);
//		tmp=water_counter[0];
//		Lcd_write_16b(tmp);

		tmp=sonar_read[0];
//		Lcd_write_digit(tmp/100);
		Lcd_write_digit(tmp);
		tmp=sonar_read[1];
//		Lcd_write_digit(tmp/100);
		Lcd_write_digit(tmp);
		Lcd_write_str("cm");

		tmp=TIM17->CNT;
		Lcd_write_16b(tmp);

			if (button==BUTTON_FWD){
						open_valve(1);
			}
			if (button==BUTTON_BCK){
					close_valve(1);
			}
		vTaskDelay(1);
		Lcd_goto(1,0);
		Lcd_write_digit(valveFlags);
		Lcd_write_str("VS");
		uint16_t val=0;
		val = VALVE_SENSOR_PORT->IDR>>5;
		Lcd_write_16b(val);
		Lcd_write_str(" ");

		vTaskDelay(1);
		if (VALVE_SENSOR_PORT->IDR>>5 & 1) {
			Lcd_write_str("1");
		}
		else {
			Lcd_write_str("0");
		}

		if (VALVE_SENSOR_PORT->IDR>>6 & 1) {
			Lcd_write_str("1");
		}
		else {
			Lcd_write_str("0");
		}

		if (VALVE_SENSOR_PORT->IDR>>7 & 1) {
			Lcd_write_str("1");
		}
		else {
			Lcd_write_str("0");
		}
#endif

