plantalog/cadi-gcl/stm32f100/grolly/current/main.c
		Lcd_write_str("W");

	}
	Lcd_clear();
	valve_test2();
	valve_test3();
}

void water_program_setup(uint8_t progId){
	// setting water fill timeout

	// setting


}

/*
void water_program_setup2(uint8_t progId){
	uint16_t addr=0, tempvalue=0;
	uint32_t tmp32, interval;

	// set fresh water fill timeout, seconds
	addr = WP_OFFSET+progId*WP_SIZE+WATER_FILL_TIMEOUT_SHIFT;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Wtr fill timeout");
	tempvalue = adjust16bit(tempvalue);
	EE_WriteVariable(addr, tempvalue);



	// set watering timeout, seconds
	addr = WP_OFFSET+progId*WP_SIZE+WP_WTRNG_TIMEOUT;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Wtrng timeout");
	tempvalue = adjust16bit(tempvalue);
	EE_WriteVariable(addr, tempvalue);

	// set watering duration, seconds
	addr = WP_OFFSET+progId*WP_SIZE+WP_INTERVAL_SHIFT;
	interval = EE_ReadWord(addr);
	Lcd_clear();
	Lcd_write_str("Set run interval");
	vTaskDelay(500);
	interval = CTimerAdjust(interval);
	EE_WriteWord(addr, interval);


	// enable watering program (=1 enables the WP)
	addr = WP_OFFSET+progId*WP_SIZE+WP_ENABLE_SHIFT;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Enable WP?");
	tempvalue = adjust8bit(tempvalue);
	EE_WriteVariable(addr, tempvalue);

//	EE_ReadWord(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Start program?");
	uint8_t button=0;
	while (button==0) {
		button=readButtons();
		vTaskDelay(10);
	}
	if (button==BUTTON_OK) {
		// set initial time point of watering program
		addr = WP_OFFSET+progId*WP_SIZE+WP_START_TIME_SHIFT;
		tmp32 = RTC_GetCounter();
		EE_WriteWord(addr, tmp32);

		addr = WP_OFFSET+progId*WP_SIZE+WP_LAST_RUN_SHIFT;
		EE_WriteWord(addr, (RTC_GetCounter()-interval+5));
//			run_watering_program(progId);
	}
	if (button==BUTTON_CNL) {
		Lcd_clear();
		Lcd_write_str("Start time");
		vTaskDelay(1000);
		addr = WP_OFFSET+progId*WP_SIZE+WP_START_TIME_SHIFT;
		tmp32 = EE_ReadWord(addr);
		tmp32 = timeAdjust(tmp32, 1);
		EE_WriteWord(addr, tmp32);
	}
	Lcd_clear();
	Lcd_write_str("End time");
	vTaskDelay(1000);
	addr = WP_OFFSET+progId*WP_SIZE+WP_END_TIME_SHIFT;
	tmp32 = EE_ReadWord(addr);
	tmp32 = timeAdjust(tmp32, 1);
	EE_WriteWord(addr, tmp32);
	Lcd_clear();
	vTaskDelay(200);

	vTaskSuspendAll();
	loadSettings();
	xTaskResumeAll();

}
*/

void fertilization_setup(void){
	uint8_t progId=0;
	Lcd_clear();
	Lcd_write_str("Program nr");
	vTaskDelay(200);
	progId = adjust8bit(progId);
	fertilizer_mixing_program_setup(progId);
}

void watering_setup(void){
	uint8_t progId=0;
	Lcd_clear();
	Lcd_write_str("Program nr");
	vTaskDelay(200);
	progId = adjust8bit(progId);
	water_program_setup(progId);
}

// set fertilizer mixing programs
void fertilizer_mixing_program_setup(uint8_t progId){
	uint16_t addr=0, tempvalue=0;

	// choose dosing pump to use
	addr = FMP_OFFSET+progId*FMP_SIZE+FMP_DOSING_PUMP_ID_SHIFT;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Fertilizer 2 use");
	tempvalue = adjust16bit(tempvalue);
	EE_WriteVariable(addr, tempvalue);

	// set dosing time, seconds
	addr = FMP_OFFSET+progId*FMP_SIZE+FMP_DOSING_TIME_SHIFT;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Dosing duration");
	tempvalue = adjust16bit(tempvalue);
	EE_WriteVariable(addr, tempvalue);

	// set circulation pump mixing time
	addr = FMP_OFFSET+progId*FMP_SIZE+FMP_CIRCULATION_MIXING_TIME_SHIFT;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Aftermix time");		// setting the time for running circulation pump to mix the fertilizer into solution
	tempvalue = adjust16bit(tempvalue);
	EE_WriteVariable(addr, tempvalue);

	// set watering program to associate this fertilizer mix program with
	addr = FMP_OFFSET+progId*FMP_SIZE+FMP_2_WP_ASSOC_SHIFT;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Link to WP");
	tempvalue = adjust16bit(tempvalue);
	EE_WriteVariable(addr, tempvalue);

	// set frequency (N), showing how often this fertilizer mixing program activates (every N watering program run)
	addr = FMP_OFFSET+progId*FMP_SIZE+FMP_TRIG_FREQUENCY_SHIFT;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Trig. freq. N");
	tempvalue = adjust16bit(tempvalue);
	EE_WriteVariable(addr, tempvalue);

	// set ENABLED/DISABLED status for this program
	addr = FMP_OFFSET+progId*FMP_SIZE+FMP_ENABLE;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("ENABLE FMP?");
	tempvalue = adjust16bit(tempvalue);
	vTaskDelay(10);
	EE_WriteVariable(addr, tempvalue);
	Lcd_clear();
	vTaskDelay(10);
	loadSettings();
}

void startWp(void){
	uint8_t progId=0, button=0;
	uint32_t addr, tmp32, interval;
	Lcd_clear();
	Lcd_write_str("Program nr");
	vTaskDelay(200);
	progId = adjust8bit(progId);
	Lcd_clear();
	Lcd_write_str("Start WP#");
	Lcd_write_digit(progId);
	Lcd_write_str("?");
	while (button!=BUTTON_OK && button!=BUTTON_CNL) {
//		dht_get_data();
		vTaskDelay(30);
		button=readButtons();
	}
	vTaskDelay(200);
	if (button==BUTTON_OK) {
		addr = WP_OFFSET+progId*WP_SIZE+WP_INTERVAL_SHIFT;
		interval = EE_ReadWord(addr);
		// set initial time point of watering program
		addr = WP_OFFSET+progId*WP_SIZE+WP_START_TIME_SHIFT;
		tmp32 = RTC_GetCounter();
		EE_WriteWord(addr, tmp32);

		addr = WP_OFFSET+progId*WP_SIZE+WP_LAST_RUN_SHIFT;
		EE_WriteWord(addr, (RTC_GetCounter()-interval+5));
//			run_watering_program(progId);
	}
	Lcd_clear();
	vTaskDelay(200);
}



void run_watering_program(uint8_t progId){
/*	wpStateFlags|=(1<<progId);	// set active flag for this program
	close_valve(DRAIN_VALVE_ID);	// close drain valve
//	valveFlags=0;	// all valves to off;
	uint16_t addr, sensorId, fmpLink, wateringPlugId=0;
	uint8_t i, waterSensorFlag=0;
	uint32_t now=0, end=0, wateringDuration=0, lastTime=0;
	vTaskDelay(1);
/*
	//r1 = 45;	// 40..45 depending on water level. top 45^2 = 2025
	uint8_t r2top = 45;
	uint8_t r1 = 40;	// bottom	40^2 = 1600

	uint8_t h = (btm_lvl-cur_lvl);
	uint32_t r2 = r1+((r2top-r1)*100*h/(btm_lvl-top_lvl))/100;
	// V = 1/3(pi*h*(r1^2+r1*r2+r2^2))
	// h = (3*V)/(pi*(r1^2+r1*r2+r2^2))
	// h = (3*10)
	uint32_t cur_vol = (3142*h*(r1^2+r1*r2+r2^2)/1000)/3;


	// count the cm-s we need to get +
	uint16_t height = 3*vol/((3.142*(r1*r1+r1*r2+r2*r2)));
*/

	// FRESH WATER INTAKE
	open_valve(FWI_VALVE);	// FWI valve
	uint16_t n=0;
	uint8_t i=0;
	uint32_t curN=0, interval=0, startime=0, now=0, end=0;
	uint16_t volume = 0, addr=0, fmpLink=0;
	addr = WP_OFFSET+progId*WP_SIZE+WP_WATER_VOLUME;
	EE_ReadVariable(addr, &volume);
	volume = sonar_read[TANK4_SONAR]-(volume & (0xFF));	// count the sonar value to expect
	now = RTC_GetCounter();
	end = now + WP_INTAKE_TIMEOUT;
	while (sonar_read[TANK4_SONAR]>volume && now<end) {
		now = RTC_GetCounter();
		vTaskDelay(25);
	}
	close_valve(FWI_VALVE);
	vTaskDelay(1000);



