plantalog/cadi-gcl/stm32f100/grolly/current/main.c
void get_fertilizer(uint8_t fertId, uint8_t secs){	// secs - number of seconds to run the fertId pump
	uint32_t reach = 0;
	// to make counting more precise wait until the next second STARTS
	reach = RTC_GetCounter()+1;
	while (RTC_GetCounter()<reach) {
		vTaskDelay(2);
	}
	reach = RTC_GetCounter()+secs;
	enable_dosing_pump(fertId,1);	// enable dosing pump
	while (RTC_GetCounter()<reach) {	// now dose the fertilizer within secs seconds
		vTaskDelay(2);		//
	}
	enable_dosing_pump(fertId,0);
}

void valve_init(void){
	close_valve(3);
	close_valve(4);
	close_valve(0);
	close_valve(1);
}

void watering_program_trigger(void *pvParameters){
	uint32_t curtime, lastRun, interval, diff, startTime, endTime;
	uint16_t addr;
	uint8_t wpStateFlag=0, progId, enabled;
	// reinit valves
	valve_init();

	while (1) {
//

		// additional low speed tasks
		tankLevelStab();
		autoSafe();
		sonar_ping();

		for (progId=0; progId<WP_AMOUNT; progId++){
			vTaskDelay(10);
			addr = WP_OFFSET+progId*WP_SIZE+WP_LAST_RUN_SHIFT;
			lastRun = EE_ReadWord(addr);
			curtime = RTC_GetCounter();
			addr = WP_OFFSET+progId*WP_SIZE+WP_INTERVAL_SHIFT;
			interval = EE_ReadWord(addr);
			diff = curtime-lastRun;
			addr = WP_OFFSET+progId*WP_SIZE+WP_START_TIME_SHIFT;
			startTime = EE_ReadWord(addr);	// program start time point
			addr = WP_OFFSET+progId*WP_SIZE+WP_END_TIME_SHIFT;
			endTime = EE_ReadWord(addr);	// program end time point
			addr = WP_OFFSET+progId*WP_SIZE+WP_FLAGS;
			EE_ReadVariable(addr, &enabled);	// program start time point
			enabled &= 1;	// ostavit' posednij bit
			vTaskDelay(10);
//			wpStateFlag=wpStateFlags&(1<<progId);	// check if WP active now
//			wpStateFlag>>=progId;	// ostavit' toka flag
			if (diff>interval && curtime>startTime && curtime<endTime && enabled==1){
				run_watering_program(progId);
			}
			vTaskDelay(10);
		}
	}

}




void dht_init(void){
	// RCC Config
	  /* TIM15 clock enable */
	  RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM15, ENABLE);

	  // GPIO Config
	  GPIO_InitTypeDef GPIO_InitStructure;

	  /* TIM15 channel 2 pin (PB15) configuration */
	  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_15;
	  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;

	  GPIO_Init(GPIOB, &GPIO_InitStructure);

	// NVIC Config

	  GPIO_PinRemapConfig(GPIO_Remap_TIM15, ENABLE);
	  NVIC_InitTypeDef NVIC_InitStructure;

	   /* Enable the TIM15 global Interrupt */

	  NVIC_InitStructure.NVIC_IRQChannel = TIM1_BRK_TIM15_IRQn;
	  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
	  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
	  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	  NVIC_Init(&NVIC_InitStructure);

	   TIM_ICInitStructure.TIM_Channel = TIM_Channel_2;
	   TIM_ICInitStructure.TIM_ICPolarity = TIM_ICPolarity_Rising;
	   TIM_ICInitStructure.TIM_ICSelection = TIM_ICSelection_DirectTI;
	   TIM_ICInitStructure.TIM_ICPrescaler = TIM_ICPSC_DIV1;
	   TIM_ICInitStructure.TIM_ICFilter = 0x0;

	   TIM_PWMIConfig(TIM15, &TIM_ICInitStructure);

	   /* Select the TIM15 Input Trigger: TI2FP2 */
	   TIM_SelectInputTrigger(TIM15, TIM_TS_TI2FP2);

	   /* Select the slave Mode: Reset Mode */
	   TIM_SelectSlaveMode(TIM15, TIM_SlaveMode_Reset);

	   /* Enable the Master/Slave Mode */
	   TIM_SelectMasterSlaveMode(TIM15, TIM_MasterSlaveMode_Enable);

	   /* TIM enable counter */
	   TIM_Cmd(TIM15, ENABLE);

	   /* Enable the CC2 Interrupt Request */
	   TIM_ITConfig(TIM15, TIM_IT_CC2, ENABLE);

}

void dht_init_out(void){	// init GPIO pin as OUTput
	 GPIOB->CRH      &= ~GPIO_CRH_CNF15;		// ... and PB15 for DHT triggering
     GPIOB->CRH   |= GPIO_CRH_MODE15_0;
}

/******************************************************************************/
/*            STM32F10x Peripherals Interrupt Handlers                        */
/******************************************************************************/

/**
  * @brief  This function handles TIM3 global interrupt request.
  * @param  None
  * @retval None
  */
void TIM3_IRQHandler(void)
{
  /* Clear TIM3 Capture compare interrupt pending bit */
  TIM_ClearITPendingBit(TIM3, TIM_IT_CC2);

  /* Get the Input Capture value */
  IC2Value = TIM_GetCapture2(TIM3);

  if (IC2Value != 0)
  {
    /* Duty cycle computation */
    DutyCycle = (TIM_GetCapture1(TIM3) * 100) / IC2Value;

    /* Frequency computation */
    Frequency = SystemCoreClock / IC2Value;
  }
  else
  {
    DutyCycle = 0;
    Frequency = 0;
  }
  dht_bit_position++;		// holds current DHT response bit sequence number

	if (dht_bit_position>dht_shifter && dht_data_ready==0) {
		if (DutyCycle>25 && DutyCycle<35) {
			dht_data[dht_byte_pointer] &= ~(1<<(dht_bit_pointer));	// reset bit in dht_data[i]
		}
		else {
			dht_data[dht_byte_pointer] |= (1<<(dht_bit_pointer)); // set bit
		}
		if (dht_bit_pointer==0){
			dht_bit_pointer=7;
			dht_byte_pointer++;
			if (dht_byte_pointer==4) {
				dht_data_ready=1;
				dht_byte_pointer = 0;
				dht_bit_pointer = 7;
//				dht_bit_position = 0;
			}
		}
		else {
			dht_bit_pointer--;
		}
	}

}

void TIM1_BRK_TIM15_IRQHandler(void)		// DHT moved from PA7 to PB15. 11.07.2013
{
  /* Clear TIM3 Capture compare interrupt pending bit */
  TIM_ClearITPendingBit(TIM15, TIM_IT_CC2);

  /* Get the Input Capture value */
  IC2Value = TIM15->CCR2;

  if (IC2Value != 0)
  {
    /* Duty cycle computation */
    DutyCycle = ((TIM15->CCR1) * 100) / IC2Value;

    /* Frequency computation */
 //   Frequency = SystemCoreClock / IC2Value;
  }
  else
  {
    DutyCycle = 0;
    Frequency = 0;
  }



  // fill one more value of dht bits array
//  dht_bit_array[dht_bit_position]=TIM_GetCapture1(TIM15);
//  dht_bit_array[dht_bit_position]=DutyCycle;
//  dht_bit_position++;
//  dht_bit_array[dht_bit_position]=TIM15->CCR2;
  dht_bit_position++;		// holds current DHT response bit sequence number

	if (dht_bit_position>dht_shifter && dht_data_ready==0) {
		if (DutyCycle>25 && DutyCycle<35) {
			dht_data[dht_byte_pointer] &= ~(1<<(dht_bit_pointer));	// reset bit in dht_data[i]
		}
		else {
			dht_data[dht_byte_pointer] |= (1<<(dht_bit_pointer)); // set bit
		}
		if (dht_bit_pointer==0){
			dht_bit_pointer=7;
			dht_byte_pointer++;
			if (dht_byte_pointer==4) {
				dht_data_ready=1;
				dht_byte_pointer = 0;
				dht_bit_pointer = 7;
//				dht_bit_position = 0;
			}
		}
		else {
			dht_bit_pointer--;
		}
	}

