plantalog/cadi-gcl/stm32f100/grolly/current/main.c
	for (i=0; i<8; i++) {
		VirtAddVarTab[i+17]=BUTTON_RANGES_START_ADDR+i;
	}

	for (i=0; i<8; i++) {
		VirtAddVarTab[i+17]=EE_TIMER1_ON+i;
	}

}

#define MENURECS	34

#ifndef TEST_MODE
// menu items
const char menuItemArray[MENURECS][18]=
{
		{"MONITOR MODE"},		// 0
		{"TIMERS"},				// 1
		{"Timer 1"},			// 2
		{"Timer 2"},			// 3
		{"Timer 3"},			// 4
		{"SET CLOCK"},			// 5
		{"CYCLIC TIMERS"},			// 6
		{"C Timer 1"},			// 7
		{"C Timer 2"},			// 8
		{"C Timer 3"},			// 9
		{"PLUG SETTINGS"},			// 10
		{"Plug 1"},			// 11
		{"Plug 2"},			// 12
		{"Plug 3"},			// 13
		{"pH-monitor"},		// 14
		{"Calibration"},	// 15
		{"pH-stabilizer"},	// 16

		{"EC-monitor"},		// 17
		{"Calibration"},	// 18
		{"EC-stabilizer"},	// 19

		{"DAYLIGHT SENSOR"},// 20
		{"   "},	// 21
		{"Keeping window"},	// 22
		{"Get water"},	// 23
		{"Add Light"},	// 24
		{"Temp. & humidity"},	// 25
		{"Hygrostat"},	// 26
		{"Thermostat"},	// 27
		{"Valve test"},	// 28
		{"Watering progs"},	// 29
		{"Fertilization"},	// 30
		{"Button test"},	// 31
		{"pH&EC test"},	// 32
		{"Start watering"}	// 33

};

// 0 - nr zapisi, 1 - link na tekst, 2 - <, 3 - >, 4 - OK, 5 - CNCL, 6 - tip zapisi (0 - folder, 1 - program)
const int fatArray[MENURECS][7]=
{
		{0,	0,	33,	1,	1,	0,	1},
		{1,	1,	0,	5,	2,	1,	1},
		{2,	2,	4,	3,	2,	1,	1},
		{3,	3,	2,	4,	3,	1,	1},
		{4,	4,	3,	2,	4,	1,	1},
		{5,	5,	1,	6,	5,	5,	1},
		{6,	6,	5,	10,	7,	6,	0},
		{7,	7,	9,	8,	6,	6,	1},
		{8,	8,	7,	9,	7,	6,	1},
		{9,	9,	8,	7,	8,	6,	1},
		{10,10,	6,	14,	11,	10,	0},
		{11,11,	13,	12,	9,	10,	1},
		{12,12,	11,	13,	10,	10,	1},
		{13,13,	12,	11,	11,	10,	1},
		{14,14,	10,	17,	15,	14,	0},
		{15,15,	16,	16,	15,	14,	1},
		{16,16,	15,	15,	16,	14,	1},
		{17,17,	14,	20,	18,	17,	0},
		{18,18,	19,	19,	23,	17,	1},	// ec calibration
		{19,19,	18,	18,	24,	17,	1},	// ec stab settings




		{20,20,	17,	21,	14,	17,	1},	// daylight sensor
		{21,21,	20,	25,	22,	18,	0},	// combi timers
		{22,22,	24,	23,	15,	22,	1},	// Tank level Keeping window setup
		{23,23,	22,	24,	16,	23,	1},	// t+2ct
		{24,24,	23,	22,	17,	24,	1},	// add light
		{25,25,	21,	26,	17,	25,	1},	// temp and humidity
		{26,26,	25,	27,	18,	26,	1},	// hygrostat
		{27,27,	26,	28,	19,	27,	1},	// thermostat
		{28,28,	27,	29,	20,	28,	1},	// valve test
		{29,29,	28,	30,	21,	29,	1},	// watering progs
		{30,30,	29,	31,	22,	30,	1},	// fertilization
		{31,31,	30,	32,	25,	31,	1},	// button test
		{32,32,	31,	33,	26,	32,	1},	// pH and ec test
		{33,33,	32,	0,	27,	33,	1}	// test function

};

#endif

#ifdef TEST_MODE
// menu items
const char menuItemArray[MENURECS][18]=
{
		{"MONITOR MODE"},		// 0
		{"TIMERS"},				// 1
		{"Tests"},	    		// 2
		{"Plug test"},			// 3
		{"PSI sensor cal."},			// 4
		{"SET CLOCK"},			// 5
		{"CYCLIC TIMERS"},			// 6
		{"C Timer 1"},			// 7
		{"C Timer 2"},			// 8
		{"C Timer 3"},			// 9
		{"PLUG SETTINGS"},			// 10
		{"Plug 1"},			// 11
		{"Plug 2"},			// 12
		{"Plug 3"},			// 13
		{"pH-monitor"},		// 14
		{"Calibration"},	// 15
		{"pH-stabilizer"},	// 16

		{"EC-monitor"},		// 17
		{"Calibration"},	// 18
		{"EC-stabilizer"},	// 19

		{"DAYLIGHT SENSOR"},// 20
		{"Tank lvl keeper"},	// 21
		{"Keeper window"},	// 22
		{"Tank tests"},	// 23
		{"Add Light"},	// 24
		{"Temp. & humidity"},	// 25
		{"Hygrostat"},	// 26
		{"Thermostat"},	// 27
		{"Valve test"},	// 28
		{"Watering progs"},	// 29
		{"Fertilization"},	// 30
		{"Button test"},	// 31
		{"pH&EC test"},	// 32
		{"Start watering"}	// 33

};

// 0 - nr zapisi, 1 - link na tekst, 2 - <, 3 - >, 4 - OK, 5 - CNCL, 6 - tip zapisi (0 - folder, 1 - program)
const int fatArray[MENURECS][7]=
{
		{0,	0,	33,	1,	1,	0,	1},
		{1,	1,	0,	2,	2,	1,	1},
		{2,	2,	1,	5,	3,	2,	0},
		{3,	3,	4,	4,	3,	1,	1},
		{4,	4,	3,	3,	4,	1,	1},
		{5,	5,	1,	6,	5,	5,	1},
		{6,	6,	5,	10,	7,	6,	0},
		{7,	7,	9,	8,	6,	6,	1},
		{8,	8,	7,	9,	7,	6,	1},
		{9,	9,	8,	7,	8,	6,	1},
		{10,10,	6,	14,	9,	10,	1},
		{11,11,	13,	12,	9,	10,	1},
		{12,12,	11,	13,	10,	10,	1},
		{13,13,	12,	11,	11,	10,	1},
		{14,14,	10,	17,	15,	14,	0},
		{15,15,	16,	16,	15,	14,	1},
		{16,16,	15,	15,	16,	14,	1},

		{17,17,	14,	20,	18,	17,	0},
		{18,18,	19,	19,	23,	17,	1},	// ec calibration
		{19,19,	18,	18,	24,	17,	1},	// ec stab settings




		{20,20,	17,	21,	14,	17,	1},	// daylight sensor
		{21,21,	20,	25,	22,	18,	0},	// keepers
		{22,22,	24,	23,	28,	22,	1},	// tank keeper level window setup
		{23,23,	22,	24,	23,	23,	1},	// t+2ct
		{24,24,	23,	22,	17,	24,	1},	// add light
		{25,25,	21,	26,	17,	25,	1},	// temp and humidity
		{26,26,	25,	27,	18,	26,	1},	// hygrostat
		{27,27,	26,	28,	19,	27,	1},	// thermostat
		{28,28,	27,	29,	20,	28,	1},	// valve test
		{29,29,	28,	30,	21,	29,	1},	// watering progs
		{30,30,	29,	31,	22,	30,	1},	// fertilization
		{31,31,	30,	32,	25,	31,	1},	// button test
		{32,32,	31,	33,	26,	32,	1},	// pH and ec test
		{33,33,	32,	0,	27,	33,	1}	// test function

};

#endif

char* adc2str(uint_fast16_t d, char* out)
{
	char out2[17];
	int i, k, c;
    out2[16] = '\0';
    out2[15] = '0' + ( d       )    % 10;
    out2[14] = '0' + ( d /= 10 )    % 10;
    out2[13] = '0' + ( d /= 10 )    % 10;
    out2[12] = '0' + ( d /= 10 )    % 10;
    out2[11] = '0' + ( d /= 10 )    % 10;
    out2[10] = '0' + ( d /= 10 )    % 10;
    vTaskDelay(25);
    out2[9] = '0' + ( d /= 10 )    % 10;
    out2[8] = '0' + ( d /= 10 )    % 10;
    out2[7] = '0' + ( d /= 10 )    % 10;
    out2[6] = '0' + ( d /= 10 )    % 10;
    out2[5] = '0' + ( d /= 10 )    % 10;
    out2[4] = '0' + ( d /= 10 )    % 10;
    out2[3] = '0' + ( d /= 10 )    % 10;
    out2[2] = '0' + ( d /= 10 )    % 10;
    out2[1] = '0' + ( d /= 10 )    % 10;
    out2[0] = '0' + ( d /  10 )    % 10;
    k=0;
    c=out2[k];
    c=48;

	vTaskDelay(25);
	while (c==48){
    	k++;
    	c=out2[k];
	}
	vTaskDelay(25);
	for (i=k; i<17; i++){
		out[i-k]=out2[i];
	}

    return out;
}

/* FRESULT sdLog2(void){

	char str[20];
	char tmpstr[15];
	int i;
	uint32_t tmp;
	tmp = RTC_GetCounter();
	FRESULT resp=0;

		int32str(tmp, &tmpstr);
		for (i=0; i<10; i++){
			str[i]=tmpstr[i];
		}
		str[10]=44;
		int32str(JDR_BUTTONS, &tmpstr);
		for (i=0;i<4;i++){
			str[i+11]=tmpstr[i+6];
		}
		str[16]=44;
		str[17]=13;
		resp = string2log(&str, 17);
	return resp;
} */

