plantalog/cadi-gcl/stm32f100/grolly/current/main.c
	//count ec underOver flag
	if (adcAverage[AVG_ADC_EC]>ecWindowTop) {
		ecUnderOver = 2;
	}
	else if (adcAverage[AVG_ADC_EC]<ecWindowBottom) {
		ecUnderOver = 1;
	}
	else {
		ecUnderOver = 0;
	}

	vTaskDelay(5);
	ph = ((adcAverage[AVG_ADC_EC] - ph0)*10)/cdel;
	currentPh = ph;
	curphstr[3] = ph-(ph/10)*10+48;
	vTaskDelay(5);
	ph/=10;
	curphstr[2]=46;
	curphstr[1] = ph-(ph/10)*10+48;
	vTaskDelay(5);
	ph/=10;
	curphstr[0]=ph-(ph/10)*10+48;
	curphstr[4] = 0;	// konec stroki
}

void getEc(void){
	uint32_t total=0, ec, ec_div;
	vTaskDelay(5);
	uint8_t i;
	if (adcAverage[AVG_ADC_EC]>ecWindowTop) {
		ecUnderOver = 2;
	}
	else if (adcAverage[AVG_ADC_EC]<ecWindowBottom) {
		ecUnderOver = 1;
	}
	else {
		ecUnderOver = 0;
	}
	vTaskDelay(5);
//	ec1413 = 200;		// this is 1.413ms
	ec_div = ((ec1413-ec0)*100)/141;		// 0.01mS = ec1413/141. We store it 100 times more for precision

	if (adcAverage[AVG_ADC_EC]>ec0) {
		ec = ((adcAverage[AVG_ADC_EC]-ec0)*100)/ec_div;	//
	}
	else {
		ec = 0;
	}
	currentEc = ec;
	curecstr[4] = '\0';
	curecstr[3] = '0' + ( ec       )    % 10;
	curecstr[2] = '0' + ( ec /= 10 )    % 10;
	curecstr[1] = '.';
	curecstr[0] = '0' + ( ec /= 10 )    % 10;

/*	curecstr[3] = ec-(ec/10)*10+48;
	vTaskDelay(5);
	ec/=10;
	curecstr[1]=46;
	curecstr[2] = ec-(ec/10)*10+48;
	vTaskDelay(5);
	ec/=10;
	curecstr[0]=ec-(ec/10)*10+48;
	curecstr[4] = 0;	// konec stroki */


/*	curecstr[3] = ec-(ec/10)*10+48;
	vTaskDelay(5);
	ec/=10;
	curecstr[2]=46;
	curphstr[1] = ec-(ec/10)*10+48;
	vTaskDelay(5);
	ec/=10;
	curecstr[0]=ec-(ec/10)*10+48;
	curecstr[4] = 0;	// konec stroki */
}


char * utoa_fast_div(uint32_t value, char *buffer)
{
    buffer += 11;
    *--buffer = 0;
    do
    {
        divmod10_t res = divmodu10(value);
        *--buffer = res.rem + '0';
        value = res.quot;
    }
    while (value != 0);


    return buffer;
}

void set16bit(uint16_t value){
	uint8_t button;
//	uint16_t Address, timerId;
//	plugId--;	// pervomu plugu sootvetstvuet nulevaja zapis' v kode (especially for menu calls)
//	Lcd_clear();
//	Lcd_goto(0,0);
//	Lcd_write_str("Plug ");
//	Lcd_write_digit(plugId);
//	Lcd_write_str(" timer");
//	Address = EE_PLUG_SETTINGS+plugId;
//	EE_ReadVariable(Address, &timerId);
//	vTaskDelay(50);
	while (button!=BUTTON_OK) {
		button=readButtons();
		vTaskDelay(25);
		if (button==BUTTON_BCK) {
			if (value<1) {
				value=65535;
			}
			else {
				value--;
			}
		}
		if (button==BUTTON_FWD) {
			if (value>65534) {
				value=0;
			}
			else {
				value++;
			}
		}
		Lcd_goto(1,0);
		Lcd_write_str("<");
		Lcd_write_digit(value);
		Lcd_write_str(">");
		vTaskDelay(25);
	}
	vTaskDelay(50);
//	Address = EE_PLUG_SETTINGS+plugId;
//	EE_WriteVariable(Address, timerId);
//	loadSettings();
//	Lcd_clear();
	printOk();
}


void setPlug(uint8_t plugId){
	uint8_t button=0;
	uint16_t Address, timerId;
//	plugId--;	// pervomu plugu sootvetstvuet nulevaja zapis' v kode (especially for menu calls)
	Lcd_clear();
	Lcd_goto(0,0);
	Lcd_write_str("Plug ");
	Lcd_write_digit(++plugId);
	Lcd_write_str(" timer");
	plugId--;
	Address = EE_PLUG_SETTINGS+plugId;
	EE_ReadVariable(Address, &timerId);
	vTaskDelay(50);
	timerId = adjust8bit(timerId);
	vTaskDelay(50);
	Address = EE_PLUG_SETTINGS+plugId;
	EE_WriteVariable(Address, timerId);
	vTaskDelay(5);
	loadSettings();
	vTaskDelay(5);
}

void printOk(void){
	Lcd_clear();
	Lcd_write_str("OK");
	vTaskDelay(500);
	Lcd_clear();
}

void timerStateTrigger(void *pvParameters){
	uint8_t i, timerStateFlag;
	uint32_t now, timer1, timer2;
	uint16_t Address;
	while (1) {
//		valve_status_updater();
		now=RTC_GetCounter();
		for (i=0; i<3; i++){	// 32 tajmera
			Address = EE_TIMER1_ON+EE_TIMER_SIZE*i;
			timer1 = EE_ReadWord(Address);
			timer2 = EE_ReadWord(Address+2);

			// for everyday triggering
			timer1 = timer1%86400;
			timer2 = timer2%86400;
			now = now % 86400;

			vTaskDelay(1);
	//		comm_manager();
			vTaskDelay(1);

			// logika obychnogo tajmera dlja timerOn<timerOff
			if (now<timer2 && now>timer1) {
				timerStateFlag=1;
			}
			else {
				timerStateFlag=0;
			}

			// obratnaja logika tajmera
			if (timer1>timer2) {
				if (now<timer1 && now>timer2) {
					timerStateFlag=0;
				}
				else {
					timerStateFlag=1;
				}
			}

			if (timerStateFlag==1) {
				timerStateFlags|=(1<<i);
			}
			else {
				timerStateFlags &= ~(1<<i); // sbrosit' flag
			}
		}
		vTaskDelay(1);
		for (i=0; i<3; i++){	// do 3 tajmerov
			Address = EE_CTIMER_DURATION+EE_CTIMER_SIZE*i;
			timer1 = EE_ReadWord(Address);
			timer2 = EE_ReadWord(Address+2);
			vTaskDelay(1);
			now=RTC_GetCounter();

			// logika ciklicheskogo tajmera
			now %= timer2;
			if (now<timer1) {
				timerStateFlag=1;
				cTimerStateFlags|=(1<<i);
			}
			else {
				timerStateFlag=0;
				cTimerStateFlags &= ~(1<<i); // sbrosit' flag
			}
			vTaskDelay(1);
		}
	}
}

void plugStateTrigger(void *pvParameters){
	uint8_t plugStateFlag, plugTimerId, plugType;
	uint8_t i;
	while (1) {
		if (comm_state!=COMM_DIRECT_DRIVE) {
			for (i=0; i<PLUG_AMOUNT; i++){		// PC0 to PC2
				plugType=0;
				plugTimerId = plugSettings[i];	// get the ID of timer for this plug
				if (plugTimerId>=0 && plugTimerId<=31) {
	//				plugType=0;
					// Timer
					plugStateFlag=timerStateFlags&(1<<plugTimerId);	// check if timer active now
					plugStateFlag>>=plugTimerId;	// ostavit' toka flag
				}
				if (plugTimerId>63 && plugTimerId<67){	// ph up
					plugType=2;
					plugTimerId-=32;
				}
				if (plugTimerId>66 && plugTimerId<69){	// ph up
					plugType=3;
					plugTimerId-=35;
				}

				if (plugTimerId>69 && plugTimerId<72){	// ph up
					plugType=4;
	//				plugTimerId-=35;
				}
				if (plugTimerId>79 && plugTimerId<81){	// 80 - PSI stab
					plugType=5;
	//				plugTimerId-=35;
				}

				if (plugTimerId==99) {	//always on
					plugType=255;
					plugStateSet(i, 1);
				}
				if (plugTimerId==98) {	// always off
					plugType=254;
					plugStateSet(i, 0);
				}

				if (plugTimerId>31 && plugTimerId<64) {
				//	plugType=1;
					// CTimer
					plugTimerId-=32;
					plugStateFlag=cTimerStateFlags&(1<<plugTimerId);	// check if timer active now
					plugStateFlag>>=plugTimerId;	// ostavit' toka flag
				}

