plantalog/cadi-gcl/stm32f100/grolly/current/main.c
/* void phStabSettings(void){
	Lcd_clear();
	Lcd_write_str("Set top lvl");
	readPhVal(value);
	EE_WriteVariable(SD_LOG_INTERVAL, logSetting);
	Lcd_write_str("Set bottom lvl");
	readPhVal(value);
	EE_WriteVariable(SD_LOG_INTERVAL, logSetting);

} */

void loggerSettings(void){
	uint32_t logSetting;
//	char value[8];
	vTaskDelay(10);
	Lcd_clear();
	EE_ReadVariable(SD_LOG_INTERVAL, &logSetting);
	vTaskDelay(100);
	Lcd_goto(0,0);
	Lcd_write_str("Log frequency");
	vTaskDelay(3000);
	logSetting=adjust8bit(logSetting);	// poluchit' novoe znachenie ot user'a
	EE_WriteVariable(SD_LOG_INTERVAL, logSetting);
	vTaskDelay(50);
	Lcd_clear();
	Lcd_goto(0,2);
	Lcd_write_str("Complete!");
	vTaskDelay(500);
	loadSettings();
	Lcd_clear();
}

void phMonSettings(void) {
//	uint16_t Address;
	uint32_t phSetting;	// possibly 16 bit?
//	char value[8];
	vTaskDelay(10);
	Lcd_clear();
	EE_ReadVariable(PH_INTERVAL, &phSetting);
	vTaskDelay(100);
	Lcd_goto(0,0);
	Lcd_write_str("Probing interval");
	vTaskDelay(1000);
	phSetting=adjust8bit(phSetting);	// poluchit' novoe znachenie ot user'a
	EE_WriteVariable(PH_INTERVAL, phSetting);
	vTaskDelay(50);


	// analogichno dlja buffer size
	EE_ReadVariable(PH_BUFF_SIZE, &phSetting);
	Lcd_clear();
	Lcd_goto(0,2);
	Lcd_write_str("Buffer size");
	vTaskDelay(500);
	phSetting=adjust8bit(phSetting);	// poluchit' novoe znachenie ot user'a
	EE_WriteVariable(PH_BUFF_SIZE, phSetting);
	Lcd_clear();
	Lcd_goto(0,2);
	Lcd_write_str("Complete!");
	vTaskDelay(500);
	loadSettings();
	Lcd_clear();
}

uint8_t adjust8bit(uint8_t val){
	uint8_t button;
	if (val>99) {val=99;}
	while (button!=BUTTON_OK) {
		button=readButtons();
		vTaskDelay(25);
		if (button==BUTTON_BCK) {
			if (val<2) {
				val=255;
			}
			else {
				val--;
			}
		}
		if (button==BUTTON_FWD) {
			if (val>254) {
				val=1;
			}
			else {
				val++;
			}
		}
		Lcd_goto(1,0);
		Lcd_write_str("< ");
		Lcd_write_8b(val);
		Lcd_write_str(" >");
		vTaskDelay(25);
	}
	printOk();
	return val;
}

uint16_t adjust16bit(uint16_t val){
	uint8_t button;
	if (val>65534) {
		val=0;
	}
	while (button!=BUTTON_OK) {
		button=readButtons();
		vTaskDelay(25);
		if (button==BUTTON_BCK) {
			if (val<1) {
				val=65535;
			}
			else {
				val--;
			}
		}
		if (button==BUTTON_FWD) {
			if (val>65534) {

				val=0;
			}
			else {
				val++;
			}
		}
		Lcd_goto(1,4);
		Lcd_write_str("< ");
		Lcd_write_16b(val);
		Lcd_write_str(" >");
		vTaskDelay(25);
	}
	printOk();
	return val;
}

uint16_t adjust16bit_fast(uint16_t val, uint8_t speed){
	uint8_t button=0;
	char buffer[11];
	if (val>65534) {
		val=0;
	}
	vTaskDelay(200);
	while (button!=BUTTON_OK) {
		button=readButtons();
		vTaskDelay(speed);
		if (button==BUTTON_BCK) {
			if (val<1) {
				val=65535;
			}
			else {
				val--;
			}
		}
		if (button==BUTTON_FWD) {
			if (val>65534) {

				val=0;
			}
			else {
				val++;
			}
		}
		Lcd_goto(1,4);
		Lcd_write_str("< ");
//		utoa_fast_div(val, &buffer);
//		copy_arr(&buffer, &LCDLine2, 5, 2);
		Lcd_write_16b(val);
		Lcd_write_str(" >");
		vTaskDelay(speed);
	}
	printOk();
	return val;
}

uint32_t CTimerAdjust(uint32_t time){
	uint8_t hours, minutes, seconds, hours2, minutes2, seconds2, button;
	char timestr[6];
	seconds = time % 60;
	time /= 60;
	minutes = time % 60;
	time /= 60;
	hours = time % 99;
	Lcd_clear();
	vTaskDelay(20);
	while (button!=BUTTON_FWD)
	{
		button=readButtons();
		if (button==BUTTON_BCK)
			{
				if (hours>98) {hours=0;}	// chtoby pechatat' pobolee znakov, nado zamenit' Lcd_write_digit()
				else {hours++;}
			}
		if (button==BUTTON_OK)
			{
				if (minutes>58) {minutes=0;}
				else {minutes++;}
			}
		if (button==BUTTON_CNL)
			{
				if (seconds>58) {seconds=0;}
				else {seconds++;}
			}

    	vTaskDelay(5);
		Lcd_goto(0,4);
    	Lcd_write_digit(hours);
    	Lcd_write_str(":");
    	Lcd_write_digit(minutes);
    	Lcd_write_str(":");
    	Lcd_write_digit(seconds);
    	vTaskDelay(5);
    	hours2=hours;		// daby izbezhat' konversii tipov pri umnozhenii na 3600 i podobnom
    	minutes2=minutes;
    	seconds2=seconds;
    	time=hours2*3600;
    	time+=minutes2*60;
    	time+=seconds2;
    	vTaskDelay(5);
    	Lcd_goto(1,3);
    	int32str(time, &timestr);
//    	Lcd_write_arr(&timestr, 6);
    	copy_arr(&timestr, LCDLine2, 10, 2);
    	vTaskDelay(10);
	}
	printOk();
	return(time);
}

void setCTimer(uint8_t timerId){
	uint16_t Address;
	uint32_t CTimerData;
//	char value[8];
	vTaskDelay(10);
	Lcd_clear();
	Address = EE_CTIMER_DURATION+timerId*EE_CTIMER_SIZE;
	CTimerData = EE_ReadWord(Address);
	if (CTimerData>356400) {
		CTimerData=356400;
	}
	Lcd_goto(0,2);
	Lcd_write_str("Set DURATION");
	vTaskDelay(3000);
	CTimerData=CTimerAdjust(CTimerData);	// poluchit' novoe znachenie ot user'a
	Address = EE_CTIMER_DURATION+timerId*EE_CTIMER_SIZE;	// adres postojanno "napominaetsja", potomu chto po-hodu ispolnenija koda on kuda-to "terjaetsja". bylo by neploho razobratsja kuda
	EE_WriteWord(Address, CTimerData);
	vTaskDelay(50);


	// analogichno dlja INTERVALa
	Address = EE_CTIMER_INTERVAL+timerId*EE_CTIMER_SIZE;
	CTimerData = EE_ReadWord(Address);
	Lcd_clear();
	Lcd_goto(0,2);
	Lcd_write_str("Set INTERVAL");
	vTaskDelay(500);
	CTimerData=CTimerAdjust(CTimerData);	// poluchit' novoe znachenie ot user'a
	Address = EE_CTIMER_INTERVAL+timerId*EE_CTIMER_SIZE;
	EE_WriteWord(Address, CTimerData);
	printOk();
}

uint8_t idSelector(uint8_t min, uint8_t max, uint8_t curid){
	uint8_t curbutton=0;
	while (curbutton!=BUTTON_OK){
		vTaskDelay(25);
		Lcd_goto(1,0);
		Lcd_write_digit(curid);
		if (curbutton==BUTTON_FWD) {
			if (curid<max) {
				curid++;
			}
		}
		if (curbutton==BUTTON_BCK) {
			if (curid>min) {
				curid--;
			}
		}
		curbutton=readButtons();
		vTaskDelay(25);
	}
	printOk();
	return curid;
}


