plantalog/cadi-gcl/stm32f100/grolly/current/main.c
	// INIT LOADS
	prvSetupHardware();
	plugStateSet(PSI_PUMP_ID, 0);	// disable all loads
	plugStateSet(1, 0);
	plugStateSet(2, 0);
	plugStateSet(3, 0);
	// EOF LOADS init


	bluetooth_init();
	Init_lcd();
	buttonCalibration();

	sonar_init();

	Lcd_clear();

#ifdef GROLLY
	test_grolly_hw();
#endif


	Lcd_clear();
	loadSettings();
	flush_lcd_buffer();	// fills the LCD frame buffer with spaces
	xTaskCreate(uart_task,(signed char*)"uart",50,
	            NULL, tskIDLE_PRIORITY + 2, NULL);
    xTaskCreate(displayClock,(signed char*)"CLK",140,
            NULL, tskIDLE_PRIORITY + 2, NULL);
    xTaskCreate(timerStateTrigger,(signed char*)"TIMERS",configMINIMAL_STACK_SIZE,
            NULL, tskIDLE_PRIORITY + 1, NULL);
    xTaskCreate(plugStateTrigger,(signed char*)"PLUGS",configMINIMAL_STACK_SIZE+35,
            NULL, tskIDLE_PRIORITY + 1, NULL);
    xTaskCreate(phMonitor,(signed char*)"PHMON",configMINIMAL_STACK_SIZE,
            NULL, tskIDLE_PRIORITY + 1, NULL);
    xTaskCreate(vTaskLCDdraw,(signed char*)"LCDDRW",configMINIMAL_STACK_SIZE,
            NULL, tskIDLE_PRIORITY + 1, NULL);
    xTaskCreate(watering_program_trigger,(signed char*)"WP",configMINIMAL_STACK_SIZE+80,
            NULL, tskIDLE_PRIORITY + 1, NULL);

/* Start the scheduler. */

    vTaskStartScheduler();

    while(1);
}


void loadSettings(void){	// function loads the predefined data
	uint16_t i, Address, Data;
//	uint8_t i2=0;
	char tmpstr[11], putstring[50];
	string2log("build date: ", 12);
	string2log(__DATE__, 11);
	string2log(" build time: ", 12);
	string2log(__TIME__, 8);
	string2log(" build ver.: ", 12);
//	string2log(VERSION_BUILD, 6);





	for (i=0;i<8;i++) {
		int32str(button_ranges[i],&tmpstr);
		tmpstr[10] = 0x0A;
		string2log(tmpstr, 12);
	}

	for (i=0; i<PLUG_AMOUNT; i++) {
		Address=EE_PLUG_SETTINGS+i;
		EE_ReadVariable(Address, &Data);
		plugSettings[i]=Data;
		if (no_sd==0) {
			string2log("plug no.", 8);
			int32str(i,&tmpstr);
			string2log(tmpstr, 11);
			string2log(" has timer no.", 14);
			int32str(plugSettings[i],&tmpstr);
			tmpstr[10] = 0x0A;
			string2log(tmpstr, 11);
		}
	}

	EE_ReadVariable(WATER_TANK_TOP, &tank_windows_top[0]);
	EE_ReadVariable(WATER_TANK_BOTTOM, &tank_windows_bottom[0]);

	EE_ReadVariable(PSI_SENSOR_TOP, &psi_pump_top_level);
	EE_ReadVariable(PSI_SENSOR_BTM, &psi_pump_btm_level);

	for (i=0; i<WFM_AMOUNT; i++) {
		EE_ReadVariable(WFM_CAL_OFFSET+i, &wfCalArray[i]);
	}


	// log FMP data

	for (i=0; i<WP_AMOUNT; i++) {
		if (no_sd==0) {
			string2log("FMP no.", 6);
			int32str(i,&tmpstr);
			string2log(tmpstr, 11);
			string2log(" has:", 5);
			tmpstr[0] = 0x0A;
			string2log(tmpstr, 1);

			Address = FMP_OFFSET+i*FMP_SIZE+FMP_DOSING_PUMP_ID_SHIFT;
			EE_ReadVariable(Address, &Data);
			string2log("- fert pump id: ", 15);
			int32str(Data,&tmpstr);
			tmpstr[10] = 0x0A;
			string2log(tmpstr, 11);

			Address = FMP_OFFSET+i*FMP_SIZE+FMP_DOSING_TIME_SHIFT;
			EE_ReadVariable(Address, &Data);
			string2log("- dosing duration: ", 19);
			int32str(Data,&tmpstr);
			tmpstr[10] = 0x0A;
			string2log(tmpstr, 11);

			Address = FMP_OFFSET+i*FMP_SIZE+FMP_CIRCULATION_MIXING_TIME_SHIFT;
			EE_ReadVariable(Address, &Data);
			string2log("- aftermix time: ", 17);
			int32str(Data,&tmpstr);
			tmpstr[10] = 0x0A;
			string2log(tmpstr, 11);

			Address = FMP_OFFSET+i*FMP_SIZE+FMP_2_WP_ASSOC_SHIFT;;
			EE_ReadVariable(Address, &Data);
			string2log("- WP link: ", 11);
			int32str(Data,&tmpstr);
			tmpstr[10] = 0x0A;
			string2log(tmpstr, 11);

			Address = FMP_OFFSET+i*FMP_SIZE+FMP_TRIG_FREQUENCY_SHIFT;
			EE_ReadVariable(Address, &Data);
			string2log("- trig freq.: ", 14);
			int32str(Data,&tmpstr);
			tmpstr[10] = 0x0A;
			string2log(tmpstr, 11);

			Address = FMP_OFFSET+i*FMP_SIZE+FMP_ENABLE;
			EE_ReadVariable(Address, &Data);
			string2log("- enabled?: ", 12);
			int32str(Data,&tmpstr);
			tmpstr[10] = 0x0A;
			string2log(tmpstr, 11);


		}
	}


	// log WateringPrograms data

/*	for (i=0; i<WP_AMOUNT; i++) {
		if (no_sd==0) {
			string2log("WP no.", 6);
			int32str(i,&tmpstr);
			string2log(tmpstr, 11);
			string2log(" has:", 5);
			tmpstr[0] = 0x0A;
			string2log(tmpstr, 1);

			Address = WP_OFFSET+i*WP_SIZE+WATER_FILL_TIMEOUT_SHIFT;
			EE_ReadVariable(Address, &Data);
			string2log("- water fill timeout: ", 21);
			int32str(Data,&tmpstr);
			tmpstr[10] = 0x0A;
			string2log(tmpstr, 11);

			Address = WP_OFFSET+i*WP_SIZE+WP_WATERING_PUMP_PLUG_ID;
			EE_ReadVariable(Address, &Data);
			string2log("- wtrng pump plug id: ", 21);
			int32str(Data,&tmpstr);
			tmpstr[10] = 0x0A;
			string2log(tmpstr, 11);

			Address = WP_OFFSET+i*WP_SIZE+WP_DURATION_SHIFT;
			EE_ReadVariable(Address, &Data);
			string2log("- wtrng duration: ", 18);
			int32str(Data,&tmpstr);
			tmpstr[10] = 0x0A;
			string2log(tmpstr, 11);

			Address = WP_OFFSET+i*WP_SIZE+WP_INTERVAL_SHIFT;
			EE_ReadVariable(Address, &Data);
			string2log("- wtrng interval: ", 18);
			int32str(Data,&tmpstr);
			tmpstr[10] = 0x0A;
			string2log(tmpstr, 11);

			Address = WP_OFFSET+i*WP_SIZE+WP_ENABLE_SHIFT;
			EE_ReadVariable(Address, &Data);
			string2log("- enabled?: ", 12);
			int32str(Data,&tmpstr);
			tmpstr[10] = 0x0A;
			string2log(tmpstr, 11);


		}
	}
*/

//	Address=LIGHT_RANGE_ADDR;
//	EE_ReadVariable(Address, &lightRange);
	EE_ReadVariable(PH4_ADDR, &ph4);

	EE_ReadVariable(CIRCULATION_PUMP_ID_ADDR, &circulationPumpId);

//	Address=PH7_ADDR;
	EE_ReadVariable(PH7_ADDR, &ph_seven);
	cdel = (ph_seven - ph4)/3;
	ph0 = ph4 - cdel*4;

	EE_ReadVariable(PH_WINDOW_TOP, &phWindowTop);
	EE_ReadVariable(PH_WINDOW_BOTTOM, &phWindowBottom);


	EE_ReadVariable(EC0_ADDR, &ec0);
	EE_ReadVariable(EC1413_ADDR, &ec1413);


	if (no_sd==0) {

		// vnesti v log znachenie kalibrovshika EC na 1.413mS
		string2log("EC1.413 set @: ", 15);
		int32str(ec1413,&tmpstr);
		tmpstr[10] = 0x0A;
		string2log(tmpstr, 11);

		// put the EC0 ADC level into log
		string2log("EC0 set @: ", 11);
		int32str(ec0,&tmpstr);
		tmpstr[10] = 0x0A;
		string2log(tmpstr, 11);

		// vnesti v log znachenie kalibrovshika ph4
		int32str(ph4,&tmpstr);
		for (i=0;i<10;i++){
			putstring[i]=tmpstr[i];
		}
		putstring[10] = 0x0A;
		string2log("ph4 cal @ ", 10);
		string2log(putstring, 11);

		// vnesti v log znachenie kalibrovshika ph7
		int32str(ph_seven,&tmpstr);
		for (i=0;i<10;i++){
			putstring[i]=tmpstr[i];
		}
		putstring[10] = 0x0A;
		string2log("ph7 cal @ ", 10);
		string2log(putstring, 11);

		// vnesti v log raschitayj uroven' ph0
		int32str(ph0,&tmpstr);
		for (i=0;i<10;i++){
			putstring[i]=tmpstr[i];
		}
		putstring[14] = 10;
		string2log("ph0 counted @ ", 14);
		string2log(putstring, 11);

		// vnesti v log raschitanuju cenu delenija
		int32str(cdel,&tmpstr);
		for (i=0;i<10;i++){
			putstring[i]=tmpstr[i];
		}
		putstring[14] = 10;
		string2log("cena delenija ", 14);
		string2log(putstring, 11);

		// ph window top
		int10str(phWindowTop,&tmpstr);
		for (i=0;i<4;i++){
			putstring[i]=tmpstr[i];
		}
		putstring[4] = 10;
		string2log("ph window top ", 14);
		string2log(putstring, 5);

